In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
df = pd.read_csv('booking_train_set.csv')

In [4]:
df.drop(['index'],axis=1,inplace = True);

In [5]:
df.head()

,user_id,checkin,checkout,city_id,device_class,affiliate_id,booker_country,hotel_country,utrip_id
0,1006220,2016-04-09,2016-04-11,31114,desktop,384,Gondal,Gondal,1006220_1
1,1006220,2016-04-11,2016-04-12,39641,desktop,384,Gondal,Gondal,1006220_1
2,1006220,2016-04-12,2016-04-16,20232,desktop,384,Gondal,Glubbdubdrib,1006220_1
3,1006220,2016-04-16,2016-04-17,24144,desktop,384,Gondal,Gondal,1006220_1
4,1010293,2016-07-09,2016-07-10,5325,mobile,359,The Devilfire Empire,Cobra Island,1010293_1

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   user_id         1048575 non-null  int64
 1   checkin         1048575 non-null  object
 2   checkout        1048575 non-null  object
 3   city_id         1048575 non-null  int64
 4   device_class    1048575 non-null  object
 5   affiliate_id    1048575 non-null  int64
 6   booker_country  1048575 non-null  object
 7   hotel_country   1048575 non-null  object
 8   utrip_id        1048575 non-null  object
dtypes: int64(3), object(6)
memory usage: 72.0+ MB

In [15]:
df.nunique()

user_id           181231
checkin              425
checkout             425
city_id            38638
device_class           3
affiliate_id        3126
booker_country         5
hotel_country        193
utrip_id          195685
dtype: int64